Repository: purnadi-winarno/edu-app
Catalog: lib/l10n/app_*.arb
Languages: id

# appTitle
source: Learning Words
id: Belajar Kata

# homeTitle
source: Learn Words
id: Belajar Kata

# homeSubtitle
source: Learn to Build Sentences in a Fun Way!
id: Belajar Menyusun Kalimat dengan Cara Menyenangkan!

# startButton
source: Start Learning
id: Mulai Bermain

# levelSelectionTitle
source: Select Level
id: Pilih Level

# levelSelectionSubtitle
source: Choose a Game Level
id: Pilih Level Permainan

# level1Description
source: Easy
id: Gampang

# level2Description
source: Medium
id: Sedang

# level3Description
source: Difficult
id: Sulit

# questionText
source: Question {current} of {total}
id: Soal {current} dari {total}

# checkAnswerButton
source: Check Answer
id: Periksa Jawaban

# correctFeedback
source: Correct! üëè
id: Benar! ğŸ‘

# incorrectFeedback
source: Wrong üòî Try again!
id: Salah ğŸ˜” Coba lagi!

# livesExhausted
source: You have run out of lives!
id: Nyawa kamu sudah habis!

# dontGiveUp
source: Don't give up, Try again!
id: Jangan menyerah, Ayo coba lagi!

# tryAgainButton
source: Try Again
id: Coba Lagi

# backToMenuButton
source: Back to Main Menu
id: Kembali ke Menu Utama

# congratulationsTitle
source: Congratulations!
id: Selamat!

# levelComplete
source: Level {level} Completed!
id: Level {level} Selesai!

source: Final Score
id: Skor Akhir

source: Remaining Lives
id: Nyawa Tersisa

# nextLevelButton
source: Next Level
id: Level Berikutnya

# languageSwitch
source: Language
id: Bahasa

# praiseMessage1
source: Good job!
id: Bagus sekali!

# praiseMessage2
source: Excellent!
id: Sempurna!

# praiseMessage3
source: Amazing work!
id: Hebat!

# praiseMessage4
source: Well done!
id: Kerja bagus!

# praiseMessage5
source: Fantastic!
id: Luar biasa!

# praiseMessage6
source: You're awesome!
id: Kamu keren!

# praiseMessage7
source: Keep it up!
id: Pertahankan!

# praiseMessage8
source: Brilliant!
id: Brilian!

# praiseMessage9
source: Outstanding!
id: Mengagumkan!

# praiseMessage10
source: Super cool!
id: Keren sekali!
